wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_timer.h
/* TIMER_CNT */
#define TIMER_CNT_UPIFBU                 BIT(31)                                    /*!< UPIF bit backup */
#define TIMER_CNT_CNT                    BITS(0,15)                                 /*!< 16 bit timer counter */

/* TIMER_PSC */
#define TIMER_PSC_PSC                    BITS(0,15)                                 /*!< prescaler value of the counter clock */

/* TIMER_CAR */
#define TIMER_CAR_CARL                   BITS(0,15)                                 /*!< 16 bit counter auto reload value */
#define TIMER_CAR_CARL_FRACT             BITS(28,31)                                /*!< fractional part of auto reload value */

/* TIMER_CREP0 */
#define TIMER_CREP0_CREP0                BITS(0,7)                                  /*!< counter repetition value 0 */

/* TIMER_CH0CV */
#define TIMER_CH0CV_CH0VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 0 */
#define TIMER_CH0CV_CH0VAL_32            BITS(0,31)                                 /*!< 32 bit capture or compare value for channel 0 */
#define TIMER_CH0CV_CH0VAL_INTEGER_32    BITS(0,28)                                 /*!< the integer part of 32 bit capture or compare value for channel 0 */
#define TIMER_CH0CV_CH0VAL_FRACT         BITS(28,31)                                /*!< fractional part of compare value of channel 0 */

/* TIMER_CH1CV */
#define TIMER_CH1CV_CH1VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 1 */
#define TIMER_CH1CV_CH1VAL_32            BITS(0,31)                                 /*!< 32 bit capture or compare value for channel 1 */
#define TIMER_CH1CV_CH1VAL_INTEGER_32    BITS(0,28)                                 /*!< the integer part of 32 bit capture or compare value for channel 1 */
#define TIMER_CH1CV_CH1VAL_FRACT         BITS(28,31)                                /*!< fractional part of compare value of channel 1 */

/* TIMER_CH2CV */
#define TIMER_CH2CV_CH2VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 2 */
#define TIMER_CH2CV_CH2VAL_32            BITS(0,31)                                 /*!< 32 bit capture or compare value for channel 2 */
#define TIMER_CH2CV_CH2VAL_INTEGER_32    BITS(0,28)                                 /*!< the integer part of 32 bit capture or compare value for channel 2 */
#define TIMER_CH2CV_CH2VAL_FRACT         BITS(28,31)                                /*!< fractional part of compare value of channel 2 */

/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL               BITS(0,15)                                 /*!< 16 bit capture or compare value of channel 3 */
#define TIMER_CH3CV_CH3VAL_32            BITS(0,31)                                 /*!< 32 bit capture or compare value for channel 3 */
#define TIMER_CH3CV_CH3VAL_INTEGER_32    BITS(0,28)                                 /*!< the integer part of 32 bit capture or compare value for channel 3 */
#define TIMER_CH3CV_CH3VAL_FRACT         BITS(28,31)                                /*!< fractional part of compare value of channel 3 */

/* TIMER_CCHP0 */
#define TIMER_CCHP0_DTCFG                BITS(0,7)                                  /*!< dead time configure */
#define TIMER_CCHP0_PROT                 BITS(8,9)                                  /*!< complementary register protect control */
#define TIMER_CCHP0_IOS                  BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_CCHP0_ROS                  BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_CCHP0_BRK0EN               BIT(12)                                    /*!< BREAK0 input signal enable */
#define TIMER_CCHP0_BRK0P                BIT(13)                                    /*!< BREAK0 input signal polarity */
#define TIMER_CCHP0_OAEN                 BIT(14)                                    /*!< output automatic enable */
#define TIMER_CCHP0_POEN                 BIT(15)                                    /*!< primary output enable */
#define TIMER_CCHP0_BRK0F                BITS(16,19)                                /*!< BREAK0 input signal filter */
#define TIMER_CCHP0_BRK1F                BITS(20,23)                                /*!< BREAK1 input signal filter */
#define TIMER_CCHP0_BRK1EN               BIT(24)                                    /*!< BREAK1 input signal enable */
#define TIMER_CCHP0_BRK1P                BIT(25)                                    /*!< BREAK1 input signal polarity */
#define TIMER_CCHP0_BRK0REL              BIT(26)                                    /*!< BREAK0 input released */
#define TIMER_CCHP0_BRK1REL              BIT(27)                                    /*!< BREAK1 input released */
#define TIMER_CCHP0_BRK0LK               BIT(28)                                    /*!< BREAK0 input locked */
#define TIMER_CCHP0_BRK1LK               BIT(29)                                    /*!< BREAK1 input locked */

/* TIMER_MCHCTL0 */
/* output compare mode */
#define TIMER_MCHCTL0_MCH0MS             (BITS(0,1) | BIT(30))                      /*!< multi mode channel 0 I/O mode selection */
#define TIMER_MCHCTL0_MCH0COMFEN         BIT(2)                                     /*!< multi mode channel 0 output compare fast enable */
#define TIMER_MCHCTL0_MCH0COMSEN         BIT(3)                                     /*!< multi mode channel 0 output compare shadow enable */
#define TIMER_MCHCTL0_MCH0COMCTL         (BITS(4,6) | BIT(16))                      /*!< multi mode channel 0 compare output control */
#define TIMER_MCHCTL0_MCH0COMCEN         BIT(7)                                     /*!< multi mode channel 0 output compare clear enable */
#define TIMER_MCHCTL0_MCH1MS             (BITS(8,9) | BIT(31))                      /*!< multi mode channel 1 I/O mode selection */
#define TIMER_MCHCTL0_MCH1COMFEN         BIT(10)                                    /*!< multi mode channel 1 output compare fast enable */
#define TIMER_MCHCTL0_MCH1COMSEN         BIT(11)                                    /*!< multi mode channel 1 output compare shadow enable */
#define TIMER_MCHCTL0_MCH1COMCTL         (BITS(12,14) | BIT(24))                    /*!< multi mode channel 1 compare output control */
#define TIMER_MCHCTL0_MCH1COMCEN         BIT(15)                                    /*!< multi mode channel 1 output compare clear enable */
/* input capture mode */
#define TIMER_MCHCTL0_MCH0CAPPSC         BITS(2,3)                                  /*!< multi mode channel 0 input capture prescaler */
#define TIMER_MCHCTL0_MCH0CAPFLT         BITS(4,7)                                  /*!< multi mode channel 0 input capture filter control */
#define TIMER_MCHCTL0_MCH1CAPPSC         BITS(10,11)                                /*!< multi mode channel 1 input capture prescaler */
#define TIMER_MCHCTL0_MCH1CAPFLT         BITS(12,15)                                /*!< multi mode channel 1 input capture filter control */

