wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_timer.h
/* TIMER_FCCHP2 */
#define TIMER_FCCHP2_DTCFG               BITS(0,7)                                  /*!< dead time configure */
#define TIMER_FCCHP2_IOS                 BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_FCCHP2_ROS                 BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_FCCHP2_DTFCFG              BITS(16,23)                                /*!< dead time falling edge configure */
#define TIMER_FCCHP2_FCCHP2EN            BIT(31)                                    /*!< free complementary channel protection register 2 enable */

/* TIMER_FCCHP3 */
#define TIMER_FCCHP3_DTCFG               BITS(0,7)                                  /*!< dead time configure */
#define TIMER_FCCHP3_IOS                 BIT(10)                                    /*!< idle mode off-state configure */
#define TIMER_FCCHP3_ROS                 BIT(11)                                    /*!< run mode off-state configure */
#define TIMER_FCCHP3_DTFCFG              BITS(16,23)                                /*!< dead time falling edge configure */
#define TIMER_FCCHP3_FCCHP3EN            BIT(31)                                    /*!< free complementary channel protection register 3 enable */

/* TIMER_AFCTL0 */
#define TIMER_AFCTL0_BRK0IN0EN           BIT(0)                                     /*!< BREAK0 BRKIN0 alternate function input enable */
#define TIMER_AFCTL0_BRK0IN1EN           BIT(1)                                     /*!< BREAK0 BRKIN1 alternate function input enable */
#define TIMER_AFCTL0_BRK0IN2EN           BIT(2)                                     /*!< BREAK0 BRKIN2 alternate function input enable */
#define TIMER_AFCTL0_BRK0CMP7EN          BIT(7)                                     /*!< BREAK0 CMP7 enable */
#define TIMER_AFCTL0_BRK0HPDFEN          BIT(8)                                     /*!< BREAK0 HPDF input enable */
#define TIMER_AFCTL0_BRK0CMP0EN          BIT(9)                                     /*!< BREAK0 CMP0 enable */
#define TIMER_AFCTL0_BRK0CMP1EN          BIT(10)                                    /*!< BREAK0 CMP1 enable */
#define TIMER_AFCTL0_BRK0CMP2EN          BIT(11)                                    /*!< BREAK0 CMP2 enable */
#define TIMER_AFCTL0_BRK0CMP3EN          BIT(12)                                    /*!< BREAK0 CMP3 enable */
#define TIMER_AFCTL0_BRK0CMP4EN          BIT(13)                                    /*!< BREAK0 CMP4 enable */
#define TIMER_AFCTL0_BRK0CMP5EN          BIT(14)                                    /*!< BREAK0 CMP5 enable */
#define TIMER_AFCTL0_BRK0CMP6EN          BIT(15)                                    /*!< BREAK0 CMP6 enable */
#define TIMER_AFCTL0_BRK0IN0P            BIT(16)                                    /*!< BREAK0 BRKIN0 alternate function input polarity */
#define TIMER_AFCTL0_BRK0IN1P            BIT(17)                                    /*!< BREAK0 BRKIN1 alternate function input polarity */
#define TIMER_AFCTL0_BRK0IN2P            BIT(18)                                    /*!< BREAK0 BRKIN2 alternate function input polarity */
#define TIMER_AFCTL0_BRK0CMP0P           BIT(25)                                    /*!< BREAK0 CMP0 input polarity */
#define TIMER_AFCTL0_BRK0CMP1P           BIT(26)                                    /*!< BREAK0 CMP1 input polarity */
#define TIMER_AFCTL0_BRK0CMP2P           BIT(27)                                    /*!< BREAK0 CMP2 input polarity */
#define TIMER_AFCTL0_BRK0CMP3P           BIT(28)                                    /*!< BREAK0 CMP3 input polarity */

/* TIMER_AFCTL1 */
#define TIMER_AFCTL1_BRK1IN0EN           BIT(0)                                     /*!< BREAK1 BRKIN0 alternate function input enable */
#define TIMER_AFCTL1_BRK1IN1EN           BIT(1)                                     /*!< BREAK1 BRKIN1 alternate function input enable */
#define TIMER_AFCTL1_BRK1IN2EN           BIT(2)                                     /*!< BREAK1 BRKIN2 alternate function input enable */
#define TIMER_AFCTL1_BRK1CMP7EN          BIT(7)                                     /*!< BREAK1 CMP7 enable */
#define TIMER_AFCTL1_BRK1HPDFEN          BIT(8)                                     /*!< BREAK1 HPDF input enable */
#define TIMER_AFCTL1_BRK1CMP0EN          BIT(9)                                     /*!< BREAK1 CMP0 enable */
#define TIMER_AFCTL1_BRK1CMP1EN          BIT(10)                                    /*!< BREAK1 CMP1 enable */
#define TIMER_AFCTL1_BRK1CMP2EN          BIT(11)                                    /*!< BREAK1 CMP2 enable */
#define TIMER_AFCTL1_BRK1CMP3EN          BIT(12)                                    /*!< BREAK1 CMP3 enable */
#define TIMER_AFCTL1_BRK1CMP4EN          BIT(13)                                    /*!< BREAK1 CMP4 enable */
#define TIMER_AFCTL1_BRK1CMP5EN          BIT(14)                                    /*!< BREAK1 CMP5 enable */
#define TIMER_AFCTL1_BRK1CMP6EN          BIT(15)                                    /*!< BREAK1 CMP6 enable */
#define TIMER_AFCTL1_BRK1IN0P            BIT(16)                                    /*!< BREAK1 BRKIN0 alternate function input polarity */
#define TIMER_AFCTL1_BRK1IN1P            BIT(17)                                    /*!< BREAK1 BRKIN1 alternate function input polarity */
#define TIMER_AFCTL1_BRK1IN2P            BIT(18)                                    /*!< BREAK1 BRKIN2 alternate function input polarity */
#define TIMER_AFCTL1_OCRINSEL            BITS(19,21)                                /*!< OCPRE_CLR inputs selection */
#define TIMER_AFCTL1_BRK1CMP0P           BIT(25)                                    /*!< BREAK1 CMP0 input polarity */
#define TIMER_AFCTL1_BRK1CMP1P           BIT(26)                                    /*!< BREAK1 CMP1 input polarity */
#define TIMER_AFCTL1_BRK1CMP2P           BIT(27)                                    /*!< BREAK1 CMP2 input polarity */
#define TIMER_AFCTL1_BRK1CMP3P           BIT(28)                                    /*!< BREAK1 CMP3 input polarity */

/* TIMER_WDGPER */
#define TIMER_WDGPER_WDGPER              BITS(0,31)                                 /*!< watchdog counter period value */

