wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_timer.h
/* TIMER_CREP1 */
#define TIMER_CREP1_CREP1                BITS(0,31)                                 /*!< counter repetition value 1 */

/* TIMER_CCHP1 */
#define TIMER_CCHP1_DTFCFG               BITS(0,7)                                  /*!< dead time falling edge configure */
#define TIMER_CCHP1_DTDIFEN              BIT(16)                                    /*!< dead time configure different enable */
#define TIMER_CCHP1_DTMODEN              BIT(17)                                    /*!< dead time modified on-the-fly enable */

/* TIMER_DECCTL */
#define TIMER_DECCTL_INDRSTEN            BIT(0)                                     /*!< index signal reset enable */
#define TIMER_DECCTL_INDRSTDIR           BITS(1,2)                                  /*!< index signal reset counter direction */
#define TIMER_DECCTL_FINDRST             BIT(5)                                     /*!< first index signal reset the counter */
#define TIMER_DECCTL_INDP                BITS(6,7)                                  /*!< index positioning */
#define TIMER_DECCTL_OPWID               BITS(16,23)                                /*!< output pulse width */
#define TIMER_DECCTL_OPPSC               BITS(24,26)                                /*!< output pulse prescaler */

/* TIMER_CINITCTL */
#define TIMER_CINITCTL_CINITVEN          BIT(0)                                     /*!< counter initial value register enable */
#define TIMER_CINITCTL_CINITDIR          BIT(1)                                     /*!< counter initial count direction */
#define TIMER_CINITCTL_SWSYNCG           BIT(2)                                     /*!< soft synchronization event generation */

/* TIMER_CINITV */
#define TIMER_CINITV_CINITVAL            BITS(0,15)                                 /*!< counter initial value */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,5)                                  /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,13)                                 /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                BITS(0,31)                                 /*!< DMA transfer buffer */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                 BIT(0)                                     /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                     /*!< write CHxVAL register selection */
#define TIMER_CFG_CREPSEL                BIT(2)                                     /*!< the counter repetition register selection */
#define TIMER_CFG_CCUSEL                 BIT(3)                                     /*!< commutation control shadow register update select */

/* constants definitions */
/* UPIFBU bit state */
typedef enum {VALID_RESET = 0, VALID_SET = 1, INVALID = 2} UPIFBUStatus;

/* TIMER init parameter struct definitions */
typedef struct {
    uint16_t prescaler;                                                             /*!< prescaler value */
    uint16_t alignedmode;                                                           /*!< aligned mode */
    uint16_t counterdirection;                                                      /*!< counter direction */
    uint32_t period;                                                                /*!< period value */
    uint16_t clockdivision;                                                         /*!< clock division value */
    uint32_t repetitioncounter;                                                     /*!< the counter repetition value */
} timer_parameter_struct;

/* break parameter struct definitions */
typedef struct {
    uint32_t runoffstate;                                                           /*!< run mode off-state */
    uint32_t ideloffstate;                                                          /*!< idle mode off-state */
    uint32_t deadtime;                                                              /*!< dead time */
    uint32_t outputautostate;                                                       /*!< output automatic enable */
    uint32_t protectmode;                                                           /*!< complementary register protect control */
    uint32_t break0state;                                                           /*!< BREAK0 input enable */
    uint32_t break0filter;                                                          /*!< BREAK0 input filter */
    uint32_t break0polarity;                                                        /*!< BREAK0 input polarity */
    uint32_t break0lock;                                                            /*!< BREAK0 input lock */
    uint32_t break0release;                                                         /*!< BREAK0 input release */
    uint32_t break1state;                                                           /*!< BREAK1 input enable */
    uint32_t break1filter;                                                          /*!< BREAK1 input filter */
    uint32_t break1polarity;                                                        /*!< BREAK1 input polarity */
    uint32_t break1lock;                                                            /*!< BREAK1 input lock */
    uint32_t break1release;                                                         /*!< BREAK1 input release */
} timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint16_t outputstate;                                                           /*!< channel output state */
    uint16_t outputnstate;                                                          /*!< channel complementary output state */
    uint16_t ocpolarity;                                                            /*!< channel output polarity */
    uint16_t ocnpolarity;                                                           /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                           /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                          /*!< idle state of channel complementary output */
} timer_oc_parameter_struct;

/* multi mode channel output parameter struct definitions */
typedef struct {
    uint16_t outputmode;                                                            /*!< multi mode channel output mode selection */
    uint16_t outputstate;                                                           /*!< multi mode channel output state */
    uint16_t ocpolarity;                                                            /*!< multi mode channel output polarity */
} timer_omc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                                                            /*!< channel input polarity */
    uint16_t icselection;                                                           /*!< channel input mode selection */
    uint16_t icprescaler;                                                           /*!< channel input capture prescaler */
    uint16_t icfilter;                                                              /*!< channel input capture filter control */
} timer_ic_parameter_struct;

