wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_timer.h
/* master mode control 0 */
#define CTL1_MMC0(regval)                   ((BITS(4,6) & ((uint32_t)(regval) << 4U)) | (BIT(25) & ((uint32_t)(regval) << 22U)))
#define TIMER_TRI_OUT0_SRC_RESET            CTL1_MMC0(0)                            /*!< the UPG bit as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_ENABLE           CTL1_MMC0(1)                            /*!< the counter enable signal as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_UPDATE           CTL1_MMC0(2)                            /*!< update event as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_CH0              CTL1_MMC0(3)                            /*!< a capture or a compare match occurred in channel 0 as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_O0CPRE           CTL1_MMC0(4)                            /*!< O0CPRE as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_O1CPRE           CTL1_MMC0(5)                            /*!< O1CPRE as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_O2CPRE           CTL1_MMC0(6)                            /*!< O2CPRE as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_O3CPRE           CTL1_MMC0(7)                            /*!< O3CPRE as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_DECODER_CLOCK    CTL1_MMC0(8)                            /*!< decoder clock as trigger output 0 */
#define TIMER_TRI_OUT0_SRC_SYNC             CTL1_MMC0(9)                            /*!< synchronization event as trigger output 0 */

/* master mode control 1 */
#define CTL1_MMC1(regval)                   (BITS(20,22) & ((uint32_t)(regval) << 20U))
#define TIMER_TRI_OUT1_SRC_RESET            CTL1_MMC1(0)                            /*!< the UPG bit as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_ENABLE           CTL1_MMC1(1)                            /*!< the counter enable signal TIMER_CTL0_CEN as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_UPDATE           CTL1_MMC1(2)                            /*!< update event as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_CH0              CTL1_MMC1(3)                            /*!< a capture or a compare match occurred in channel 0 as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_O0CPRE           CTL1_MMC1(4)                            /*!< O0CPRE as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_O1CPRE           CTL1_MMC1(5)                            /*!< O1CPRE as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_O2CPRE           CTL1_MMC1(6)                            /*!< O2CPRE as trigger output 1 */
#define TIMER_TRI_OUT1_SRC_O3CPRE           CTL1_MMC1(7)                            /*!< O3CPRE as trigger output 1 */

/* TIMER decoder detection enable */
#define TIMER_DECJUMPDEN                    TIMER_CTL2_DECJDEN                      /*!< quadrature decoder signal jump (the two signals jump at the same time) detection enable */
#define TIMER_DECDISCONNECTDEN              TIMER_CTL2_DECDISDEN                    /*!< quadrature decoder signal disconnection detection enable */

/* master slave mode selection */
#define TIMER_MASTER_SLAVE_MODE_ENABLE      TIMER_SMCFG_MSM                         /*!< master slave mode enable */
#define TIMER_MASTER_SLAVE_MODE_DISABLE     ((uint32_t)0x00000000U)                 /*!< master slave mode disable */

/* external trigger prescaler */
#define SMCFG_ETPSC(regval)                 (BITS(12,13) & ((uint32_t)(regval) << 12U))
#define TIMER_EXT_TRI_PSC_OFF               SMCFG_ETPSC(0)                          /*!< no divided */
#define TIMER_EXT_TRI_PSC_DIV2              SMCFG_ETPSC(1)                          /*!< divided by 2 */
#define TIMER_EXT_TRI_PSC_DIV4              SMCFG_ETPSC(2)                          /*!< divided by 4 */
#define TIMER_EXT_TRI_PSC_DIV8              SMCFG_ETPSC(3)                          /*!< divided by 8 */

/* external trigger polarity */
#define TIMER_ETP_FALLING                   TIMER_SMCFG_ETP                         /*!< active low or falling edge active */
#define TIMER_ETP_RISING                    ((uint32_t)0x00000000U)                 /*!< active high or rising edge active */

/* channel 0 trigger input selection */
#define TIMER_HALLINTERFACE_ENABLE          TIMER_CTL1_TI0S                         /*!< TIMER hall sensor mode enable */
#define TIMER_HALLINTERFACE_DISABLE         ((uint32_t)0x00000000U)                 /*!< TIMER hall sensor mode disable */

/* TIMER write CHxVAL register selection */
#define TIMER_CHVSEL_ENABLE                 ((uint16_t)TIMER_CFG_CHVSEL)            /*!< write CHxVAL register selection enable */
#define TIMER_CHVSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< write CHxVAL register selection disable */

/* TIMER output value selection enable */
#define TIMER_OUTSEL_ENABLE                 ((uint16_t)TIMER_CFG_OUTSEL)            /*!< output value selection enable */
#define TIMER_OUTSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< output value selection disable */

/* TIMER commutation control shadow register update selection enable */
#define TIMER_CCUSEL_ENABLE                 ((uint16_t)TIMER_CFG_CCUSEL)            /*!< commutation control shadow register update selection enable */
#define TIMER_CCUSEL_DISABLE                ((uint16_t)0x0000U)                     /*!< commutation control shadow register update selection disable */

/* channel additional output compare shadow enable */
#define TIMER_ADD_SHADOW_ENABLE             ((uint16_t)0x0001U)                     /*!< channel additional output shadow state enable */
#define TIMER_ADD_SHADOW_DISABLE            ((uint16_t)0x0000U)                     /*!< channel additional output shadow state disable */

/* channel output compare shadow enable */
#define TIMER_OMC_SHADOW_ENABLE             ((uint16_t)0x0008U)                     /*!< multi mode channel output shadow state enable */
#define TIMER_OMC_SHADOW_DISABLE            ((uint16_t)0x0000U)                     /*!< multi mode channel output shadow state disable */

/* channel additional output compare register update source */
#define TIMER_ADD_UPDATE_BY_UPDATE          ((uint16_t)0x0000U)                     /*!< channel additional compare value register update by update event */
#define TIMER_ADD_UPDATE_BY_COM_MATCH       ((uint16_t)0x0001U)                     /*!< channel additional compare value register update by compare value match event */

