wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_timer.h
/* channel output compare clear enable */
#define TIMER_OMC_CLEAR_ENABLE              ((uint16_t)0x0080U)                     /*!< multi mode channel output clear function enable */
#define TIMER_OMC_CLEAR_DISABLE             ((uint16_t)0x0000U)                     /*!< multi mode channel output clear function disable */

/* channel output compare fast enable */
#define TIMER_OMC_FAST_ENABLE               ((uint16_t)0x0004U)                     /*!< multi mode channel output compare fast function enable */
#define TIMER_OMC_FAST_DISABLE              ((uint16_t)0x0000U)                     /*!< multi mode channel output compare fast function disable */

/* TIMER counter repetition register selection */
#define TIMER_CREP1_ENABLE                  ((uint16_t)TIMER_CFG_CREPSEL)           /*!< the update event rate is depended to TIMERx_CREP1 register */
#define TIMER_CREP0_ENABLE                  ((uint16_t)0x0000U)                     /*!< the update event rate is depended to TIMERx_CREP0 register */

/* TIMER output value selection */
#define TIMER_PULSE_OUTPUT_NORMAL           ((uint16_t)0x0000U)                     /*!< channel output normal */
#define TIMER_PULSE_OUTPUT_CNT_UP           ((uint16_t)0x0001U)                     /*!< pulse output only when counting up */
#define TIMER_PULSE_OUTPUT_CNT_DOWN         ((uint16_t)0x0002U)                     /*!< pulse output only when counting down */
#define TIMER_PULSE_OUTPUT_CNT_BOTH         ((uint16_t)0x0003U)                     /*!< pulse output when counting up or down */
#define TIMER_PULSE_OUTPUT_MASK             ((uint16_t)0x0003U)                     /*!< pulse output mode mask */

/* multi mode channel input capture polarity */
#define TIMER_IMC_POLARITY_RISING           ((uint16_t)0x0000U)                     /*!< multi mode channel input capture rising edge */
#define TIMER_IMC_POLARITY_FALLING          ((uint16_t)0x0001U)                     /*!< multi mode channel input capture falling edge */
#define TIMER_IMC_POLARITY_BOTH_EDGE        ((uint16_t)0x0003U)                     /*!< multi mode channel input capture both edge */

/* channel output polarity */
#define TIMER_OC_MCH_POLARITY_HIGH          ((uint16_t)0x0000U)                     /*!< channel output polarity is high */
#define TIMER_OC_MCH_POLARITY_LOW           ((uint16_t)0x0001U)                     /*!< channel output polarity is low */

/* TIMER multi mode channel mode selection */
#define TIMER_MCH_MODE_INDEPENDENTLY        ((uint16_t)0x0000U)                     /*!< multi mode channel work in independently mode */
#define TIMER_MCH_MODE_COMPLEMENTARY        ((uint16_t)0x0003U)                     /*!< multi mode channel work in complementary output mode */
#define TIMER_MCH_MODE_MASK                 ((uint16_t)0x0003U)                     /*!< multi mode channel mode mask */

/* TIMER OCPRE_CLR_INT source selection */
#define TIMER_OCPRE_CLR_INT_OCPRE_CLR       ((uint32_t)0x00000000U)                 /*!< OCPRE_CLR_INT is connected to the OCPRE_CLR input */
#define TIMER_OCPRE_CLR_INT_ETIF            TIMER_SMCFG_OCRC                        /*!< OCPRE_CLR_INT is connected to ETIF */

/* TIMER OCREF_CLR input selection */
#define AFCTL1_OCRINSEL(regval)             (BITS(19,21) & ((uint32_t)(regval) << 19U))
#define TIMER_OCPRE_CLR_INPUT_0             AFCTL1_OCRINSEL(0)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 0 */
#define TIMER_OCPRE_CLR_INPUT_1             AFCTL1_OCRINSEL(1)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 1 */
#define TIMER_OCPRE_CLR_INPUT_2             AFCTL1_OCRINSEL(2)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 2 */
#define TIMER_OCPRE_CLR_INPUT_3             AFCTL1_OCRINSEL(3)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 3 */
#define TIMER_OCPRE_CLR_INPUT_4             AFCTL1_OCRINSEL(4)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 4 */
#define TIMER_OCPRE_CLR_INPUT_5             AFCTL1_OCRINSEL(5)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 5 */
#define TIMER_OCPRE_CLR_INPUT_6             AFCTL1_OCRINSEL(6)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 6 */
#define TIMER_OCPRE_CLR_INPUT_7             AFCTL1_OCRINSEL(7)                      /*!< OCPRE_CLR_INT is connected to OCPRE_CLR 7 */

/* TIMER index signal reset counter direction */
#define DECCTL_INDRSTDIR(regval)            (BITS(1,2) & ((uint32_t)(regval) << 1U))
#define TIMER_INDEX_RESET_DIRECTION_BOTH    DECCTL_INDRSTDIR(0)                     /*!< index signal resets the counter when it counts up and down */
#define TIMER_INDEX_RESET_DIRECTION_UP      DECCTL_INDRSTDIR(1)                     /*!< index signal resets the counter when it counts up */
#define TIMER_INDEX_RESET_DIRECTION_DOWN    DECCTL_INDRSTDIR(2)                     /*!< index signal resets the counter when it counts down */

/* TIMER first index signal selection */
#define TIMER_FIRST_INDEX_SIGNAL_DISABLE    ((uint32_t)0x00000000U)                 /*!< all the index signal are can reset the counter */
#define TIMER_FIRST_INDEX_SIGNAL_ENABLE     TIMER_DECCTL_FINDRST                    /*!< only the first index signal is active and can reset the counter */

/* TIMER index position configure */
/* in quadrature decoder modes 0~4 */
#define DECCTL_INDP(regval)                 (BITS(6,7) & ((uint32_t)(regval) << 6U))
#define TIMER_INDEX_POSITION_AB_00          DECCTL_INDP(0)                          /*!< when AB inputs are 00, index event will reset the counter */
#define TIMER_INDEX_POSITION_AB_01          DECCTL_INDP(1)                          /*!< when AB inputs are 01, index event will reset the counter */
#define TIMER_INDEX_POSITION_AB_10          DECCTL_INDP(2)                          /*!< when AB inputs are 10, index event will reset the counter */
#define TIMER_INDEX_POSITION_AB_11          DECCTL_INDP(3)                          /*!< when AB inputs are 11, index event will reset the counter */
/* in decoder modes 0~3 */
#define TIMER_INDEX_POSITION_LOW            ((uint32_t)0x00000000U)                 /*!< when clock is low, index event will reset the counter */
#define TIMER_INDEX_POSITION_HIGH           ((uint32_t)0x00000040U)                 /*!< when clock is high, index event will reset the counter */

/* TIMER decoder mode update source */
#define TIMER_DEC_UPDATE_BY_UPDATE          ((uint32_t)0x00000000U)                 /*!< decoder mode is updated by the update event */
#define TIMER_DEC_UPDATE_BY_INDEX           TIMER_SMCFG_DECMODS                     /*!< decoder mode is updated by the index event */

/* TIMER initial counter direction */
#define TIMER_INITIAL_DIRECTION_UP        ((uint32_t)0x00000000U)                 /*!< counter count down when synchronization event occurs */
#define TIMER_INITIAL_DIRECTION_DOWN          TIMER_CINITCTL_CINITDIR                 /*!< counter count up when synchronization event occurs */

/* function declarations */
/* TIMER timebase */
/* deinit a TIMER */
void timer_deinit(uint32_t timer_periph);
/* initialize TIMER init parameter struct */
void timer_struct_para_init(timer_parameter_struct *initpara);
/* initialize TIMER counter */
void timer_init(uint32_t timer_periph, timer_parameter_struct *initpara);
/* enable a TIMER */
void timer_enable(uint32_t timer_periph);
/* disable a TIMER */
void timer_disable(uint32_t timer_periph);
/* enable the auto reload shadow function */
void timer_auto_reload_shadow_enable(uint32_t timer_periph);
/* disable the auto reload shadow function */
void timer_auto_reload_shadow_disable(uint32_t timer_periph);
/* enable the update event */
void timer_update_event_enable(uint32_t timer_periph);
/* disable the update event */
void timer_update_event_disable(uint32_t timer_periph);
/* set TIMER counter alignment mode */
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned);
/* set TIMER counter up direction */
void timer_counter_up_direction(uint32_t timer_periph);
/* set TIMER counter down direction */
void timer_counter_down_direction(uint32_t timer_periph);
/* configure the TIMER adjustment mode function */
void timer_adjustment_mode_config(uint32_t timer_periph, ControlStatus newvalue);

/* configure TIMER prescaler */
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload);
/* configure TIMER repetition register value */
void timer_repetition_value_config(uint32_t timer_periph, uint16_t ccsel, uint32_t repetition);
/* configure TIMER runtime repetition register value */
uint32_t timer_runtime_repetition_value_read(uint32_t timer_periph);
/* configure TIMER auto reload register value */
void timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload);
/* configure TIMER fractional part of auto reload register value */
void timer_auto_reload_fract_value_config(uint32_t timer_periph, uint32_t fract);
/* read TIMER auto reload register value */
uint32_t timer_autoreload_value_read(uint32_t timer_periph);
/* read TIMER fractional part of auto reload register value */
uint32_t timer_auto_reload_fract_value_read(uint32_t timer_periph);
/* configure TIMER counter register value */
void timer_counter_value_config(uint32_t timer_periph, uint32_t counter);
/* read TIMER counter value */
uint32_t timer_counter_read(uint32_t timer_periph);
/* read TIMER prescaler value */
uint16_t timer_prescaler_read(uint32_t timer_periph);
/* configure TIMER single pulse mode */
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode);
/* configure timer delayable single pulse mode */
void timer_delayable_single_pulse_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t dspmode, uint16_t cnt_dir);
/* configure TIMER update source */
void timer_update_source_config(uint32_t timer_periph, uint32_t update);
/* configure timer OCPRE_CLR_INT source */
void timer_ocpre_clear_source_config(uint32_t timer_periph, uint32_t clear_source);
/* configure timer OCPRE_CLR input */
void timer_ocpre_clear_input_config(uint32_t timer_periph, uint32_t clear_input);
/* configure the TIMER pulse on compare function */
void timer_pulse_on_compare_config(uint32_t timer_periph, uint32_t pulse_width, uint32_t pulse_prescaler);

/* TIMER DMA and event */
/* enable the TIMER DMA */
void timer_dma_enable(uint32_t timer_periph, uint32_t dma);
/* disable the TIMER DMA */
void timer_dma_disable(uint32_t timer_periph, uint32_t dma);
/* channel DMA request source selection */
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint32_t dma_request);
/* configure the TIMER DMA transfer */
void timer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth);
/* software generate events */
void timer_event_software_generate(uint32_t timer_periph, uint32_t event);

/* TIMER channel complementary protection */
/* initialize TIMER break parameter struct */
void timer_break_struct_para_init(timer_break_parameter_struct *breakpara);
/* configure TIMER break function */
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct *breakpara);
/* enable TIMER break function */
void timer_break_enable(uint32_t timer_periph, uint16_t break_num);
/* disable TIMER break function */
void timer_break_disable(uint32_t timer_periph, uint16_t break_num);
/* enable TIMER output automatic function */
void timer_automatic_output_enable(uint32_t timer_periph);
/* disable TIMER output automatic function */
void timer_automatic_output_disable(uint32_t timer_periph);
/* configure TIMER primary output function */
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure channel commutation control shadow register */
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure TIMER channel control shadow register update control */
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl);

/* TIMER channel output */
/* initialize TIMER channel output parameter struct */
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara);
/* configure TIMER channel output function */
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara);
/* configure TIMER channel output compare mode */
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode);
/* configure TIMER channel output pulse value */
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse);
/* configure TIMER channel fractional part of output pulse value */
void timer_channel_output_pulse_fract_value_config(uint32_t timer_periph, uint16_t channel, uint32_t fract);
/* configure TIMER channel output shadow function */
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* configure TIMER channel output clear function */
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear);
/* configure TIMER channel output compare fast function */
void timer_channel_output_compare_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast);
/* configure TIMER channel output polarity */
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity);
/* configure TIMER channel complementary output polarity */
void timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity);
/* configure TIMER channel enable state */
void timer_channel_output_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state);
/* configure TIMER channel complementary output enable state */
void timer_channel_complementary_output_state_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnstate);

/* TIMER channel input */
/* initialize TIMER channel input parameter struct */
void timer_channel_input_struct_para_init(timer_ic_parameter_struct *icpara);
/* configure TIMER input capture parameter */
void timer_input_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpara);
/* configure TIMER channel input capture prescaler value */
void timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler);
/* read TIMER channel capture compare register value */
uint32_t timer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel);
/* configure TIMER input pwm capture function */
void timer_input_pwm_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpwm);
/* configure TIMER hall sensor mode */
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode);

/* TIMER multi mode channel */
/* initialize TIMER multi mode channel output parameter struct */
void timer_multi_mode_channel_output_parameter_struct_init(timer_omc_parameter_struct *omcpara);
/* configure TIMER multi mode channel output function */
void timer_multi_mode_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_omc_parameter_struct *omcpara);
/* multi mode channel mode select */
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel);

